---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyFloat
source: html/face7f32-baee-3d42-d9dd-68b9565071ce.htm
---
# AssetPropertyFloat Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.